podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/I2S0_2CH_MK82F25615.svd.xml
            <register>
               <name>TCR3</name>
               <description>SAI Transmit Configuration 3 Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>WDFL</name>
                     <description>Word Flag Configuration
Configures which word sets the start of word flag.\n
The value written must be one less than the word number.\n
For example, writing 0 configures the first word in the frame</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TCE</name>
                     <description>Transmit Channel Enable\n
Enables the corresponding data channel for transmit operation.\n
A channel must be enabled before its FIFO is accessed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>$(CHANNEL_COUNT)</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CFR</name>
                     <description>Channel FIFO Reset</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transmit data channel N FIFO is reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR4</name>
               <description>SAI Transmit Configuration 4 Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>FSD</name>
                     <description>Frame Sync Direction\n
Configures the direction of the frame sync</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>External Frame Sync\t(slave mode)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Internal Frame Sync\t(master mode)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSP</name>
                     <description>Frame Sync Polarity\n
Configures the polarity of the frame sync</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ONDEM</name>
                     <description>On Demand Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Internal frame sync is generated continuously</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Internal frame sync is generated when the FIFO warning flag is clear</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSE</name>
                     <description>Frame Sync Early\n
Control where frame sync asserts relative to 1st bit of the frame</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Asserts with first bit</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Asserts one bit before first bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MF</name>
                     <description>MSB First\n
Configures whether the LSB or the MSB is transmitted/received first</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>LSB first</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MSB first</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYWD</name>
                     <description>Sync Width\n
Configures the length of the frame sync in number of bit clocks.\n
The value written must be one less than the number of bit clocks.\n
 or example, write 0 for the frame sync to assert for one bit clock only</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FRSZ</name>
                     <description>Frame size\n
Configures the number of words in each frame.\n
The value written must be one less than the number of words in the frame.\n
For example, write 0 for one word per frame</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FPACK</name>
                     <description>FIFO Packing Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FIFO packing is disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>8-bit FIFO packing is enabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>16-bit FIFO packing is enabled</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCOMB</name>
                     <description>FIFO Combine Mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FIFO combine mode disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>FIFO combine mode enabled on FIFO reads (from transmit shift registers)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>FIFO combine mode enabled on FIFO writes (by software)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>FIFO combine mode enabled on FIFO reads (from transmit shift registers) and writes (by software)</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCONT</name>
                     <description>FIFO Continue on Error</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>On FIFO error, the SAI will continue from the start of the next frame after the FIFO error flag has been cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>On FIFO error, the SAI will continue from the same word that caused the FIFO error to set after the FIFO warning flag has been cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR5</name>
               <description>SAI Transmit Configuration 5 Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>FBT</name>
                     <description>First Bit Shifted\n
Configures the bit index for the first bit transmitted for each word in the frame.\n
If configured for MSB First, the index of the next bit transmitted is one less than the current bit transmitted.\n
If configured for LSB First, the index of the next bit transmitted is one more than the current bit transmitted</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>W0W</name>
                     <description>Word 0 Width\n
Configures the number of bits in the first word in each frame.\n
The value written must be one less than the number of bits in the first word.\n
Word width of less than 8 bits is not supported if there is only one word per frame</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>WNW</name>
                     <description>Word N Width\n
Configures the number of bits in each word, for each word except the first in the frame.\n
The value written must be one less than the number of bits per word.\n
The value of WNW must be greater than or equal to the value of W0W even when there is only one word in each frame.\n
Word width of less than 8 bits is not supported</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>$(CHANNEL_COUNT)</dim>
               <dimIncrement>4</dimIncrement>
               <name>TDR%s</name>
               <description>Transmit Data Register\n
The corresponding TCR3[TCE] bit must be set before accessing the channel&apos;s transmit data register.\n
Writes to this register when the transmit FIFO is not full will push the data written into the transmit data FIFO.\n
Writes to this register when the transmit FIFO is full are ignored</description>
               <addressOffset>0x20</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TDR</name>
                     <description>Transmit Data Register</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>$(CHANNEL_COUNT)</dim>
               <dimIncrement>4</dimIncrement>
               <name>TFR%s</name>
               <description>SAI Transmit FIFO Register</description>
               <addressOffset>0x40</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RFP</name>
                     <description>Read FIFO Pointer\n
FIFO read pointer for transmit data channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WFP</name>
                     <description>Write FIFO Pointer\n
FIFO write pointer for transmit data channel</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WCP</name>
                     <description>Write Channel Pointer</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FIFO combine is enabled for FIFO writes and this FIFO will be written on the next FIFO write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMR</name>
               <description>SAI Transmit Mask Register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>TWM</name>
                     <description>Transmit Word Mask\n
Configures whether the transmit word is masked (transmit data pin tri-stated and \n
transmit data not read from FIFO) for the corresponding word in the frame</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Word N enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Word N is masked\t- The transmit data pins are tri-stated when masked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
